[Killed] StringLiteral
src/resources/gold.ts:8:22
 
     constructor() {
         super();
-        this._name = "Gold";
+        this._name = "";
     }
 
killedBy: Gold tests given a new Gold object then name should be 'Gold'
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Gold"
Received: ""
