[Killed] BlockStatement
src/resource.ts:11:47
         return this._quantity;
     }
 
-    public addQuantity(quantity: number): void{
-        this._quantity += quantity;
-    }
+    public addQuantity(quantity: number): void{}
 
     public subtractQuantity(quantity: number): void{
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: no resource for exchange

[Killed] AssignmentOperator
src/resource.ts:12:9
     }
 
     public addQuantity(quantity: number): void{
-        this._quantity += quantity;
+        this._quantity -= quantity;
     }
 
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: no resource for exchange

[Killed] BlockStatement
src/resource.ts:15:52
         this._quantity += quantity;
     }
 
-    public subtractQuantity(quantity: number): void{
-        this._quantity -= quantity;
-    }
+    public subtractQuantity(quantity: number): void{}
 }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 10

[Killed] AssignmentOperator
src/resource.ts:16:9
     }
 
     public subtractQuantity(quantity: number): void{
-        this._quantity -= quantity;
+        this._quantity += quantity;
     }
 }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 20
