[Killed] BooleanLiteral
src/build.ts:8:27
     private _nextUpgrade: number;
     constructor(){
         this._level = 0;
-        this._upgrading = false;
+        this._upgrading = true;
         this._daysToUpgrade = 0;
         this._nextUpgrade = 2;
killedBy: build tests given a new build object then this object should have upgrading false
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] BlockStatement
src/build.ts:13:35
         this._nextUpgrade = 2;
     }
 
-    private executeUpgrade(): void{
-        this._level++;
-        this._upgrading = false;
-        this._daysToUpgrade = this._nextUpgrade;
-        this._nextUpgrade += 2;
-    }
+    private executeUpgrade(): void{}
     public upgrade(): void{
         this._upgrading = true;
killedBy: build tests given a new object after call upgrade and progressUpgrade level should be 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] UpdateOperator
src/build.ts:14:9
     }
 
     private executeUpgrade(): void{
-        this._level++;
+        this._level--;
         this._upgrading = false;
         this._daysToUpgrade = this._nextUpgrade;
killedBy: build tests given a new object after call upgrade and progressUpgrade level should be 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: -1

[Killed] BooleanLiteral
src/build.ts:15:27
 
     private executeUpgrade(): void{
         this._level++;
-        this._upgrading = false;
+        this._upgrading = true;
         this._daysToUpgrade = this._nextUpgrade;
         this._nextUpgrade += 2;
killedBy: build tests given a new object after call upgrade and progrssUpgrade upgrading should be false
statusReason: Error: expect(received).toBeFalsy()

Received: true

[Killed] AssignmentOperator
src/build.ts:17:9
         this._level++;
         this._upgrading = false;
         this._daysToUpgrade = this._nextUpgrade;
-        this._nextUpgrade += 2;
+        this._nextUpgrade -= 2;
     }
     public upgrade(): void{
killedBy: build tests given a object already upgraded and upgrade again daysToUpgrade should be 4
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 4
Received: 0

[Killed] BlockStatement
src/build.ts:19:27
         this._daysToUpgrade = this._nextUpgrade;
         this._nextUpgrade += 2;
     }
-    public upgrade(): void{
-        this._upgrading = true;
-    }
+    public upgrade(): void{}
 
     public progressUpgrade(): void{
killedBy: build tests given a new object after call upgrade the upgrading method is true
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BooleanLiteral
src/build.ts:20:27
         this._nextUpgrade += 2;
     }
     public upgrade(): void{
-        this._upgrading = true;
+        this._upgrading = false;
     }
 
killedBy: build tests given a new object after call upgrade the upgrading method is true
statusReason: Error: expect(received).toBeTruthy()

Received: false

[Killed] BlockStatement
src/build.ts:23:35
         this._upgrading = true;
     }
 
-    public progressUpgrade(): void{
-        if(this._upgrading && this._daysToUpgrade === 0){
-            this.executeUpgrade();
-        } else if(this._upgrading){
-            this._daysToUpgrade--;
-        }
-    }
+    public progressUpgrade(): void{}
 
     get level(): number{
killedBy: build tests given a new object after call upgrade and progressUpgrade level should be 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] BlockStatement
src/build.ts:24:57
     }
 
     public progressUpgrade(): void{
-        if(this._upgrading && this._daysToUpgrade === 0){
-            this.executeUpgrade();
-        } else if(this._upgrading){
+        if(this._upgrading && this._daysToUpgrade === 0){} else if(this._upgrading){
             this._daysToUpgrade--;
         }
killedBy: build tests given a new object after call upgrade and progressUpgrade level should be 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] EqualityOperator
src/build.ts:24:31
     }
 
     public progressUpgrade(): void{
-        if(this._upgrading && this._daysToUpgrade === 0){
+        if(this._upgrading && this._daysToUpgrade !== 0){
             this.executeUpgrade();
         } else if(this._upgrading){
killedBy: build tests given a new object after call upgrade and progressUpgrade level should be 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
src/build.ts:26:19
     public progressUpgrade(): void{
         if(this._upgrading && this._daysToUpgrade === 0){
             this.executeUpgrade();
-        } else if(this._upgrading){
+        } else if(true){
             this._daysToUpgrade--;
         }
killedBy: build tests given a new object after call progressUpgrade this object have no side effects
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 0
Received: -1

[Killed] BlockStatement
src/build.ts:26:35
     public progressUpgrade(): void{
         if(this._upgrading && this._daysToUpgrade === 0){
             this.executeUpgrade();
-        } else if(this._upgrading){
-            this._daysToUpgrade--;
-        }
+        } else if(this._upgrading){}
     }
 
killedBy: build tests given a object already upgraded and upgrade again after progressUpgrade daysToUpgrade has decremented to 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 2

[Killed] UpdateOperator
src/build.ts:27:13
         if(this._upgrading && this._daysToUpgrade === 0){
             this.executeUpgrade();
         } else if(this._upgrading){
-            this._daysToUpgrade--;
+            this._daysToUpgrade++;
         }
     }
killedBy: build tests given a object already upgraded and upgrade again after progressUpgrade daysToUpgrade has decremented to 1
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: 1
Received: 3
