[Killed] BlockStatement
src/builds/traders/marketplace.ts:56:45
     get foodSellPrice(): number {
         return this._foodSellPrice;
     }
-    public buyStone(quantity: number): void {
-        const totalCost = quantity * this._stoneBuyPrice;
-        this.trade(this._stone, this._gold, quantity, totalCost);
-    }
+    public buyStone(quantity: number): void {}
 }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 10

[Killed] ArithmeticOperator
src/builds/traders/marketplace.ts:57:27
         return this._foodSellPrice;
     }
     public buyStone(quantity: number): void {
-        const totalCost = quantity * this._stoneBuyPrice;
+        const totalCost = quantity / this._stoneBuyPrice;
         this.trade(this._stone, this._gold, quantity, totalCost);
     }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 7.5
