[Killed] BlockStatement
src/producer.ts:13:47
         this._resource = resource;
     }
 
-    improveProduction(quantity: number): void {
-        this._productionQuantity += quantity;
-    }
+    improveProduction(quantity: number): void {}
 
     produce(){
killedBy: Producer tests given a new Producer object when improving production then production quantity has to be increased
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] AssignmentOperator
src/producer.ts:14:9
     }
 
     improveProduction(quantity: number): void {
-        this._productionQuantity += quantity;
+        this._productionQuantity -= quantity;
     }
 
killedBy: Producer tests given a new Producer object when improving production then production quantity has to be increased
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: -5

[Killed] BlockStatement
src/producer.ts:17:14
         this._productionQuantity += quantity;
     }
 
-    produce(){
-        this._resource.addQuantity(this._productionQuantity);
-    }
+    produce(){}
 }
killedBy: Producer tests given a new Producer object when improving production then production quantity has to be increased
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0
