[Killed] BlockStatement
src/tax_collector.ts:14:33
         this._maxTaxValue = 4;
         this._resource = resource;
     }
-    set taxValue(value: number) {
-        if (value < 0) {
-            throw new Error("Tax value cannot be negative");
-        }
-        if (value > this._maxTaxValue) {
-            throw new Error(`Tax value cannot exceed ${this._maxTaxValue}`);
-        }
-        this._taxValue = value;
-    }
+    set taxValue(value: number) {}
 
     get taxValue(): number {
killedBy: Tax Collector Tests should set tax value correctly within limits
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/tax_collector.ts:15:13
         this._resource = resource;
     }
     set taxValue(value: number) {
-        if (value < 0) {
+        if (false) {
             throw new Error("Tax value cannot be negative");
         }
killedBy: Tax Collector Tests should throw an error when setting a negative tax value
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Tax value cannot be negative"

Received function did not throw

[Killed] EqualityOperator
src/tax_collector.ts:15:13
         this._resource = resource;
     }
     set taxValue(value: number) {
-        if (value < 0) {
+        if (value <= 0) {
             throw new Error("Tax value cannot be negative");
         }
killedBy: Tax Collector Tests should not throw an error when setting a tax value of 0
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Tax value cannot be negative"

      73 |         } else {
      74 |           stryCov_9fa48("73");
    > 75 |           throw new Error(stryMutAct_9fa48("74") ? "" : (stryCov_9fa48("74"), "Tax value cannot be negative"));

[Killed] EqualityOperator
src/tax_collector.ts:18:13
         if (value < 0) {
             throw new Error("Tax value cannot be negative");
         }
-        if (value > this._maxTaxValue) {
+        if (value >= this._maxTaxValue) {
             throw new Error(`Tax value cannot exceed ${this._maxTaxValue}`);
         }
killedBy: Tax Collector Tests should not throw an error when setting tax value to max
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Tax value cannot exceed 4"

      81 |         } else {
      82 |           stryCov_9fa48("79");
    > 83 |           throw new Error(stryMutAct_9fa48("80") ? `` : (stryCov_9fa48("80"), `Tax value cannot exceed ${this._maxTaxValue}`));

[Killed] BlockStatement
src/tax_collector.ts:18:40
         if (value < 0) {
             throw new Error("Tax value cannot be negative");
         }
-        if (value > this._maxTaxValue) {
-            throw new Error(`Tax value cannot exceed ${this._maxTaxValue}`);
-        }
+        if (value > this._maxTaxValue) {}
         this._taxValue = value;
     }
killedBy: Tax Collector Tests should throw an error when setting a tax value greater than max
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Tax value cannot exceed 4"

Received function did not throw

[Killed] BlockStatement
src/tax_collector.ts:32:24
         return this._maxTaxValue;
     }
 
-    collectTax(): void {
-        this._resource.addQuantity(this._taxValue);
-    }
+    collectTax(): void {}
     
 }
killedBy: Tax Collector Tests should collect tax and add it to the resource
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0
