[Killed] BlockStatement
src/trader.ts:13:6
         resourceToSell: Resource,
         quantityToBuy: number,
         quantityToSell: number
-    ){
-        if (resourceToSell.quantity < quantityToSell) {
-            throw new Error("no resource for exchange");
-        }
-        resourceToBuy.addQuantity(quantityToBuy);
-        resourceToSell.subtractQuantity(quantityToSell);
-    }
+    ){}
 }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 10

[Killed] BlockStatement
src/trader.ts:14:55
         quantityToBuy: number,
         quantityToSell: number
     ){
-        if (resourceToSell.quantity < quantityToSell) {
-            throw new Error("no resource for exchange");
-        }
+        if (resourceToSell.quantity < quantityToSell) {}
         resourceToBuy.addQuantity(quantityToBuy);
         resourceToSell.subtractQuantity(quantityToSell);
killedBy: Marketplace Tests should buy stone with no gold available
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "no resource for exchange"

Received function did not throw

[Killed] ConditionalExpression
src/trader.ts:14:13
         quantityToBuy: number,
         quantityToSell: number
     ){
-        if (resourceToSell.quantity < quantityToSell) {
+        if (true) {
             throw new Error("no resource for exchange");
         }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: no resource for exchange
