[Killed] BlockStatement
src/trader.ts:13:6
         resourceToSell: Resource,
         quantityToBuy: number,
         quantityToSell: number
-    ){
-        if (resourceToSell.quantity < quantityToSell) {
-            throw new Error("Not enough resource to sell");
-        }
-        resourceToBuy.addQuantity(quantityToBuy);
-        resourceToSell.subtractQuantity(quantityToSell);
-    }
+    ){}
 }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 10

[Killed] EqualityOperator
src/trader.ts:14:13
         quantityToBuy: number,
         quantityToSell: number
     ){
-        if (resourceToSell.quantity < quantityToSell) {
+        if (resourceToSell.quantity <= quantityToSell) {
             throw new Error("Not enough resource to sell");
         }
killedBy: Marketplace Tests should buy stone and deduct gold correctly
statusReason: Error: Not enough resource to sell
